zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp133cxx_ca7.h
  __IO uint32_t MP_AHB4LPENSETR;     /*!< RCC AHB4 Sleep clock enable set register                   Address offset: 0x858 */
  __IO uint32_t MP_AHB4LPENCLRR;     /*!< RCC AHB4 Sleep clock enable clear register                 Address offset: 0x85C */
       uint32_t RESERVED21[2];       /*!< Reserved                                                   Address offset: 0x860-0x864 */
  __IO uint32_t MP_S_AHB4LPENSETR;   /*!< RCC secure AHB4 Sleep clock enable set register            Address offset: 0x868 */
  __IO uint32_t MP_S_AHB4LPENCLRR;   /*!< RCC secure AHB4 Sleep clock enable clear register          Address offset: 0x86C */
  __IO uint32_t MP_NS_AHB4LPENSETR;  /*!< RCC non-secure AHB4 Sleep clock enable set register        Address offset: 0x870 */
  __IO uint32_t MP_NS_AHB4LPENCLRR;  /*!< RCC non-secure AHB4 Sleep clock enable clear register      Address offset: 0x874 */
  __IO uint32_t MP_AHB5LPENSETR;     /*!< RCC AHB5 Sleep clock enable set register                   Address offset: 0x878 */
  __IO uint32_t MP_AHB5LPENCLRR;     /*!< RCC AHB5 Sleep clock enable clear register                 Address offset: 0x87C */
  __IO uint32_t MP_AHB6LPENSETR;     /*!< RCC AHB6 Sleep clock enable set register                   Address offset: 0x880 */
  __IO uint32_t MP_AHB6LPENCLRR;     /*!< RCC AHB6 Sleep clock enable clear register                 Address offset: 0x884 */
  __IO uint32_t MP_S_AHB6LPENSETR;   /*!< RCC secure AHB6 Sleep clock enable set register            Address offset: 0x888 */
  __IO uint32_t MP_S_AHB6LPENCLRR;   /*!< RCC secure AHB6 Sleep clock enable clear register          Address offset: 0x88C */
  __IO uint32_t MP_NS_AHB6LPENSETR;  /*!< RCC non-secure AHB6 Sleep clock enable set register        Address offset: 0x890 */
  __IO uint32_t MP_NS_AHB6LPENCLRR;  /*!< RCC non-secure AHB6 Sleep clock enable clear register      Address offset: 0x894 */
  __IO uint32_t MP_S_AXIMLPENSETR;   /*!< RCC secure AXI Sleep clock enable set register             Address offset: 0x898 */
  __IO uint32_t MP_S_AXIMLPENCLRR;   /*!< RCC secure AXI Sleep clock enable clear register           Address offset: 0x89C */
  __IO uint32_t MP_NS_AXIMLPENSETR;  /*!< RCC non-secure AXI Sleep clock enable set register         Address offset: 0x8A0 */
  __IO uint32_t MP_NS_AXIMLPENCLRR;  /*!< RCC non-secure AXI Sleep clock enable clear register       Address offset: 0x8A4 */
  __IO uint32_t MP_MLAHBLPENSETR;    /*!< RCC MLAHB Sleep clock enable set register                  Address offset: 0x8A8 */
  __IO uint32_t MP_MLAHBLPENCLRR;    /*!< RCC MLAHB Sleep clock enable clear register                Address offset: 0x8AC */
       uint32_t RESERVED22[4];       /*!< Reserved                                                   Address offset: 0x8B0-0x8BC */
  __IO uint32_t APB3SECSR;           /*!< RCC APB3 peripheral secure state register                  Address offset: 0x8C0 */
  __IO uint32_t APB4SECSR;           /*!< RCC APB4 peripheral secure state register                  Address offset: 0x8C4 */
  __IO uint32_t APB5SECSR;           /*!< RCC APB5 peripheral secure state register                  Address offset: 0x8C8 */
  __IO uint32_t APB6SECSR;           /*!< RCC APB6 peripheral secure state register                  Address offset: 0x8CC */
  __IO uint32_t AHB2SECSR;           /*!< RCC AHB2 peripheral secure state register                  Address offset: 0x8D0 */
  __IO uint32_t AHB4SECSR;           /*!< RCC AHB4 peripheral secure state register                  Address offset: 0x8D4 */
  __IO uint32_t AHB5SECSR;           /*!< RCC AHB5 peripheral secure state register                  Address offset: 0x8D8 */
  __IO uint32_t AHB6SECSR;           /*!< RCC AHB6 peripheral secure state register                  Address offset: 0x8DC */
       uint32_t RESERVED23[453];     /*!< Reserved                                                   Address offset: 0x8E0-0xFF0 */
  __IO uint32_t VERR;                /*!< RCC Version register                                       Address offset: 0xFF4 */
  __IO uint32_t IDR;                 /*!< RCC ID register                                            Address offset: 0xFF8 */
  __IO uint32_t SIDR;                /*!< RCC Size ID register                                       Address offset: 0xFFC */
} RCC_TypeDef;

/**
  * @brief Hardware Debug Port
  */

typedef struct
{
  __IO uint32_t HDP_CTRL;                  /*!< HDP Control Register,                                Address offset: 0x00 */
  __IO uint32_t HDP_MUX;                   /*!< HDP Multiplexers Control Register,                   Address offset: 0x04 */
       uint32_t RESERVED0[2];              /*!< Reserved, 0x08-0x0C                                  Address offset: 0x08 */
  __IO uint32_t HDP_VAL;                   /*!< HDP Read Back Value Register,                        Address offset: 0x10 */
  __IO uint32_t HDP_GPOSET;                /*!< HDP General Purpose Output Set Register,             Address offset: 0x14 */
  __IO uint32_t HDP_GPOCLR;                /*!< HDP General Purpose Output Clear Register,           Address offset: 0x18 */
  __IO uint32_t HDP_GPOVAL;                /*!< HDP General Purpose Output Value Register,           Address offset: 0x1C */
       uint32_t RESERVED1[245];            /*!< Reserved, 0x20-0x3F4                                 Address offset: 0x20 */
  __IO uint32_t VERR;                  /*!< HDP Version Register,                                Address offset: 0x3F4 */
  __IO uint32_t IPIDR;                 /*!< HDP IP Identification Register,                      Address offset: 0x3F8 */
  __IO uint32_t SIDR;                  /*!< HDP Size Identification register,                    Address offset: 0x3FC */
} HDP_TypeDef;


/**
  * @brief Boot and Security and OTP Control
  */

typedef struct
{
  __IO uint32_t BSEC_OTP_CONFIG;           /*!< BSEC OTP Configuration,                              Address offset: 0x00 */
  __IO uint32_t BSEC_OTP_CONTROL;          /*!< BSEC OTP Control,                                    Address offset: 0x04 */
  __IO uint32_t BSEC_OTP_WRDATA;           /*!< BSEC OTP Write Data,                                 Address offset: 0x08 */
  __IO uint32_t BSEC_OTP_STATUS;           /*!< BSEC OTP Status,                                     Address offset: 0x0C */
  __IO uint32_t BSEC_OTP_LOCK;             /*!< BSEC OTP Configuration,                              Address offset: 0x10 */
  __IO uint32_t BSEC_DENABLE;              /*!< BSEC Debug Configuration,                            Address offset: 0x14 */
  __IO uint32_t RESERVED0x18;              /*!< Reserved,                                            Address offset: 0x18 */
  __IO uint32_t BSEC_OTP_DISTURBED0;       /*!< BSEC OTP Disturbed Status,                           Address offset: 0x1C */
  __IO uint32_t BSEC_OTP_DISTURBED1;       /*!< BSEC OTP Disturbed Status,                           Address offset: 0x20 */
  __IO uint32_t BSEC_OTP_DISTURBED2;       /*!< BSEC OTP Disturbed Status,                           Address offset: 0x24 */
       uint32_t RESERVED0x28;              /*!< Reserved,                                            Address offset: 0x28 */
       uint32_t RESERVED0x2C;              /*!< Reserved,                                            Address offset: 0x2C */
       uint32_t RESERVED0x30;              /*!< Reserved,                                            Address offset: 0x30 */
  __IO uint32_t BSEC_OTP_ERROR0;           /*!< BSEC OTP Error Status,                               Address offset: 0x34 */
  __IO uint32_t BSEC_OTP_ERROR1;           /*!< BSEC OTP Error Status,                               Address offset: 0x38 */
  __IO uint32_t BSEC_OTP_ERROR2;           /*!< BSEC OTP Error Status,                               Address offset: 0x3C */
       uint32_t RESERVED0x40;              /*!< Reserved,                                            Address offset: 0x40 */
       uint32_t RESERVED0x44;              /*!< Reserved,                                            Address offset: 0x44 */
       uint32_t RESERVED0x48;              /*!< Reserved,                                            Address offset: 0x48 */
  __IO uint32_t BSEC_OTP_WRLOCK0;          /*!< BSEC OTP Lock status,                                Address offset: 0x4C */
  __IO uint32_t BSEC_OTP_WRLOCK1;          /*!< BSEC OTP Lock status,                                Address offset: 0x50 */
  __IO uint32_t BSEC_OTP_WRLOCK2;          /*!< BSEC OTP Lock status,                                Address offset: 0x54 */
       uint32_t RESERVED0x58;              /*!< Reserved,                                            Address offset: 0x58 */
       uint32_t RESERVED0x5C;              /*!< Reserved,                                            Address offset: 0x5C */
       uint32_t RESERVED0x60;              /*!< Reserved,                                            Address offset: 0x60 */
  __IO uint32_t BSEC_OTP_SPLOCK0;          /*!< BSEC OTP prg lock under ctrl by stick bits,          Address offset: 0x64 */
  __IO uint32_t BSEC_OTP_SPLOCK1;          /*!< BSEC OTP prg lock under ctrl by stick bits,          Address offset: 0x68 */
  __IO uint32_t BSEC_OTP_SPLOCK2;          /*!< BSEC OTP prg lock under ctrl by stick bits,          Address offset: 0x6C */
       uint32_t RESERVED0x70;              /*!< Reserved,                                            Address offset: 0x70 */
       uint32_t RESERVED0x74;              /*!< Reserved,                                            Address offset: 0x74 */
       uint32_t RESERVED0x78;              /*!< Reserved,                                            Address offset: 0x78 */
  __IO uint32_t BSEC_OTP_SWLOCK0;          /*!< BSEC OTP Shadow Write Lck under ctrl by sticky bits, Address offset: 0x7C */
  __IO uint32_t BSEC_OTP_SWLOCK1;          /*!< BSEC OTP Shadow Write Lck under ctrl by sticky bits, Address offset: 0x80 */
  __IO uint32_t BSEC_OTP_SWLOCK2;          /*!< BSEC OTP Shadow Write Lck under ctrl by sticky bits, Address offset: 0x84 */
       uint32_t RESERVED0x88;              /*!< Reserved,                                            Address offset: 0x88 */
       uint32_t RESERVED0x8C;              /*!< Reserved,                                            Address offset: 0x8C */
       uint32_t RESERVED0x90;              /*!< Reserved,                                            Address offset: 0x90 */
  __IO uint32_t BSEC_OTP_SRLOCK0;          /*!< BSEC OTP Shadow read lock under ctrl by sticky bits, Address offset: 0x94 */
  __IO uint32_t BSEC_OTP_SRLOCK1;          /*!< BSEC OTP Shadow read lock under ctrl by sticky bits, Address offset: 0x98 */
  __IO uint32_t BSEC_OTP_SRLOCK2;          /*!< BSEC OTP Shadow read lock under ctrl by sticky bits, Address offset: 0x9C */
       uint32_t RESERVED0xA0;              /*!< Reserved,                                            Address offset: 0xA0 */
       uint32_t RESERVED0xA4;              /*!< Reserved,                                            Address offset: 0xA4 */
       uint32_t RESERVED0xA8;              /*!< Reserved,                                            Address offset: 0xA8 */
  __IO uint32_t BSEC_JTAGIN;               /*!< BSEC JTAG Input,                                     Address offset: 0xAC */
  __IO uint32_t BSEC_JTAGOUT;              /*!< BSEC JTAG Output,                                    Address offset: 0xB0 */
  __IO uint32_t BSEC_SCRATCH;              /*!< BSEC SCRATCH,                                        Address offset: 0xB4 */
       uint32_t RESERVED0xB8[82];          /*!< Reserved, 0x0B8-0x200                                Address offset: 0xB8 */
  __IO uint32_t BSEC_OTP_DATA[96];         /*!< BSEC Shadow Registers,                               Address offset: 0x200 */
       uint32_t RESERVED0x380[796];        /*!< Reserved, 0x0380-0xFF0                               Address offset: 0x380 */
  __IO uint32_t HWCFGR;                    /*!< BSEC IP HW Configuration Register,                   Address offset: 0xFF0 */
  __IO uint32_t VERR;                      /*!< BSEC IP version Register,                            Address offset: 0xFF4 */
  __IO uint32_t IPIDR;                     /*!< BSEC ID Register,                                    Address offset: 0xFF8 */
  __IO uint32_t SIDR;                      /*!< BSEC SID Register,                                   Address offset: 0xFFC */
} BSEC_TypeDef;


/**
  * @brief RTC Specific device feature definitions
  */
#define RTC_BACKUP_NB       32u /* Backup registers implemented */
#define RTC_TAMP_NB         8u  /* External tamper events (input pins) supported */

/**
  * @brief Real-Time Clock
  */

typedef struct
{
  __IO uint32_t TR;             /*!< RTC time register                                Address offset: 0x000 */
  __IO uint32_t DR;             /*!< RTC date register                                Address offset: 0x004 */
  __IO uint32_t SSR;            /*!< RTC sub second register                          Address offset: 0x008 */
  __IO uint32_t ICSR;           /*!< RTC initialization control and status register   Address offset: 0x00C */
  __IO uint32_t PRER;           /*!< RTC prescaler register                           Address offset: 0x010 */
  __IO uint32_t WUTR;           /*!< RTC wakeup timer register                        Address offset: 0x014 */
  __IO uint32_t CR;             /*!< RTC control register                             Address offset: 0x018 */
  __IO uint32_t PRIVCR;         /*!< RTC privilege mode control register              Address offset: 0x01C */
  __IO uint32_t SECCFGR;        /*!< RTC secure mode control register                 Address offset: 0x020 */
  __IO uint32_t WPR;            /*!< RTC write protection register                    Address offset: 0x024 */
  __IO uint32_t CALR;           /*!< RTC calibration register                         Address offset: 0x028 */
  __IO uint32_t SHIFTR;         /*!< RTC shift control register                       Address offset: 0x02C */
  __IO uint32_t TSTR;           /*!< RTC timestamp time register                      Address offset: 0x030 */
  __IO uint32_t TSDR;           /*!< RTC timestamp date register                      Address offset: 0x034 */
  __IO uint32_t TSSSR;          /*!< RTC timestamp sub second register                Address offset: 0x038 */
       uint32_t RESERVED0;      /*!< Reserved                                         Address offset: 0x03C */
  __IO uint32_t ALRMAR;         /*!< RTC alarm A register                             Address offset: 0x040 */
  __IO uint32_t ALRMASSR;       /*!< RTC alarm A sub second register                  Address offset: 0x044 */
  __IO uint32_t ALRMBR;         /*!< RTC alarm B register                             Address offset: 0x048 */
  __IO uint32_t ALRMBSSR;       /*!< RTC alarm B sub second register                  Address offset: 0x04C */
  __IO uint32_t SR;             /*!< RTC Status register                              Address offset: 0x050 */
  __IO uint32_t MISR;           /*!< RTC non-secure masked interrupt status register  Address offset: 0x054 */
  __IO uint32_t SMISR;          /*!< RTC secure masked interrupt status register      Address offset: 0x058 */
  __IO uint32_t SCR;            /*!< RTC status Clear register                        Address offset: 0x05C */
  __IO uint32_t OR;             /*!< RTC configuration register                       Address offset: 0x060 */
       uint32_t RESERVED1[3];   /*!< Reserved                                         Address offset: 0x064-0x06C */
  __IO uint32_t ALRABINR;       /*!< RTC alarm A binary mode register                 Address offset: 0x070 */
  __IO uint32_t ALRBBINR;       /*!< RTC alarm B binary mode register                 Address offset: 0x074 */
       uint32_t RESERVED2[222];   /*!< Reserved                                       Address offset: 0x078-0x3EC */
  __IO uint32_t HWCFGR;         /*!< RTC hardware configuration register              Address offset: 0x3F0 */
  __IO uint32_t VERR;           /*!< RTC version register                             Address offset: 0x3F4 */
  __IO uint32_t IPIDR;          /*!< RTC identification register                      Address offset: 0x3F8 */
  __IO uint32_t SIDR;           /*!< RTC size identification register                 Address offset: 0x3FC */
} RTC_TypeDef;


/**
  * @brief Tamper and Backup registers
  */
typedef struct
{
  __IO uint32_t CR1;           /*!< TAMP control register 1                                 Address offset: 0x000 */
  __IO uint32_t CR2;           /*!< TAMP control register 2                                 Address offset: 0x004 */
  __IO uint32_t CR3;           /*!< TAMP control register 3                                 Address offset: 0x008 */
  __IO uint32_t FLTCR;         /*!< TAMP filter control register                            Address offset: 0x00C */
  __IO uint32_t ATCR1;         /*!< TAMP active tamper control register 1                   Address offset: 0x010 */
  __IO uint32_t ATSEEDR;       /*!< TAMP active tamper seed register                        Address offset: 0x014 */
  __IO uint32_t ATOR;          /*!< TAMP active tamper output register                      Address offset: 0x018 */
  __IO uint32_t ATCR2;         /*!< TAMP active tamper control register 2                   Address offset: 0x01C */
  __IO uint32_t SECCFGR;       /*!< TAMP secure mode register                               Address offset: 0x020 */
  __IO uint32_t PRIVCR;        /*!< TAMP privilege mode control register                    Address offset: 0x024 */
       uint32_t RESERVED0;     /*!< Reserved                                                Address offset: 0x028 */
  __IO uint32_t IER;           /*!< TAMP interrupt enable register                          Address offset: 0x02C */
  __IO uint32_t SR;            /*!< TAMP status register                                    Address offset: 0x030 */
  __IO uint32_t MISR;          /*!< TAMP non-secure masked interrupt status register        Address offset: 0x034 */
  __IO uint32_t SMISR;         /*!< TAMP secure masked interrupt status register            Address offset: 0x038 */
  __IO uint32_t SCR;           /*!< TAMP status clear register                              Address offset: 0x03C */
  __IO uint32_t COUNT1R;       /*!< TAMP monotonic counter 1 register                       Address offset: 0x040 */
       uint32_t RESERVED2[3];  /*!< Reserved,                                               Address offset: 0x044-0x04C */
  __IO uint32_t OR;            /*!< TAMP output register                                    Address offset: 0x050 */
       uint32_t RESERVED3[43]; /*!< Reserved                                                Address offset: 0x054-0x0FC */
  __IO uint32_t BKP0R;         /*!< TAMP backup register 0,                                 Address offset: 0x100 */
  __IO uint32_t BKP1R;         /*!< TAMP backup register 1,                                 Address offset: 0x104 */
  __IO uint32_t BKP2R;         /*!< TAMP backup register 2,                                 Address offset: 0x108 */
  __IO uint32_t BKP3R;         /*!< TAMP backup register 3,                                 Address offset: 0x10C */
  __IO uint32_t BKP4R;         /*!< TAMP backup register 4,                                 Address offset: 0x110 */
  __IO uint32_t BKP5R;         /*!< TAMP backup register 5,                                 Address offset: 0x114 */
  __IO uint32_t BKP6R;         /*!< TAMP backup register 6,                                 Address offset: 0x118 */
  __IO uint32_t BKP7R;         /*!< TAMP backup register 7,                                 Address offset: 0x11C */
  __IO uint32_t BKP8R;         /*!< TAMP backup register 8,                                 Address offset: 0x120 */
  __IO uint32_t BKP9R;         /*!< TAMP backup register 9,                                 Address offset: 0x124 */
  __IO uint32_t BKP10R;        /*!< TAMP backup register 10,                                Address offset: 0x128 */
  __IO uint32_t BKP11R;        /*!< TAMP backup register 11,                                Address offset: 0x12C */
  __IO uint32_t BKP12R;        /*!< TAMP backup register 12,                                Address offset: 0x130 */
  __IO uint32_t BKP13R;        /*!< TAMP backup register 13,                                Address offset: 0x134 */
  __IO uint32_t BKP14R;        /*!< TAMP backup register 14,                                Address offset: 0x138 */
  __IO uint32_t BKP15R;        /*!< TAMP backup register 15,                                Address offset: 0x13C */
  __IO uint32_t BKP16R;        /*!< TAMP backup register 16,                                Address offset: 0x140 */
  __IO uint32_t BKP17R;        /*!< TAMP backup register 17,                                Address offset: 0x144 */
  __IO uint32_t BKP18R;        /*!< TAMP backup register 18,                                Address offset: 0x148 */
  __IO uint32_t BKP19R;        /*!< TAMP backup register 19,                                Address offset: 0x14C */
  __IO uint32_t BKP20R;        /*!< TAMP backup register 20,                                Address offset: 0x150 */
  __IO uint32_t BKP21R;        /*!< TAMP backup register 21,                                Address offset: 0x154 */
  __IO uint32_t BKP22R;        /*!< TAMP backup register 22,                                Address offset: 0x158 */
  __IO uint32_t BKP23R;        /*!< TAMP backup register 23,                                Address offset: 0x15C */
  __IO uint32_t BKP24R;        /*!< TAMP backup register 24,                                Address offset: 0x160 */
  __IO uint32_t BKP25R;        /*!< TAMP backup register 25,                                Address offset: 0x164 */
  __IO uint32_t BKP26R;        /*!< TAMP backup register 26,                                Address offset: 0x168 */
  __IO uint32_t BKP27R;        /*!< TAMP backup register 27,                                Address offset: 0x16C */
  __IO uint32_t BKP28R;        /*!< TAMP backup register 28,                                Address offset: 0x170 */
  __IO uint32_t BKP29R;        /*!< TAMP backup register 29,                                Address offset: 0x174 */
  __IO uint32_t BKP30R;        /*!< TAMP backup register 30,                                Address offset: 0x178 */
  __IO uint32_t BKP31R;        /*!< TAMP backup register 31,                                Address offset: 0x17C */
       uint32_t RESERVED5[155]; /*!< Reserved, 0x180 - 0x3E8                                                      */
  __IO uint32_t HWCFGR2;        /*!< TAMP hardware configuration register,                  Address offset: 0x3EC */
  __IO uint32_t HWCFGR1;        /*!< TAMP hardware configuration register,                  Address offset: 0x3F0 */
  __IO uint32_t VERR;           /*!< TAMP version register,                                 Address offset: 0x3F4 */
  __IO uint32_t IPIDR;          /*!< TAMP identification register,                          Address offset: 0x3F8 */
  __IO uint32_t SIDR;           /*!< TAMP size identification register,                     Address offset: 0x3FC */
} TAMP_TypeDef;


/**
  * @brief Serial Audio Interface
  */

