zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp133cxx_ca7.h
/*****************  Bit definition for ADC_SIDR register  ******************/
#define ADC_SIDR_SID_Pos                  (0U)
#define ADC_SIDR_SID_Msk                  (0xFFFFFFFFUL << ADC_SIDR_SID_Pos)    /*!< 0xFFFFFFFF */
#define ADC_SIDR_SID                      ADC_SIDR_SID_Msk                     /*!< Size Identification */
#define ADC_SIDR_SID_0                    (0x1UL << ADC_SIDR_SID_Pos)           /*!< 0x00000001 */
#define ADC_SIDR_SID_1                    (0x2UL << ADC_SIDR_SID_Pos)           /*!< 0x00000002 */
#define ADC_SIDR_SID_2                    (0x4UL << ADC_SIDR_SID_Pos)           /*!< 0x00000004 */
#define ADC_SIDR_SID_3                    (0x8UL << ADC_SIDR_SID_Pos)           /*!< 0x00000008 */
#define ADC_SIDR_SID_4                    (0x10UL << ADC_SIDR_SID_Pos)          /*!< 0x00000010 */
#define ADC_SIDR_SID_5                    (0x20UL << ADC_SIDR_SID_Pos)          /*!< 0x00000020 */
#define ADC_SIDR_SID_6                    (0x40UL << ADC_SIDR_SID_Pos)          /*!< 0x00000040 */
#define ADC_SIDR_SID_7                    (0x80UL << ADC_SIDR_SID_Pos)          /*!< 0x00000080 */
#define ADC_SIDR_SID_8                    (0x100UL << ADC_SIDR_SID_Pos)         /*!< 0x00000100 */
#define ADC_SIDR_SID_9                    (0x200UL << ADC_SIDR_SID_Pos)         /*!< 0x00000200 */
#define ADC_SIDR_SID_10                   (0x400UL << ADC_SIDR_SID_Pos)         /*!< 0x00000400 */
#define ADC_SIDR_SID_11                   (0x800UL << ADC_SIDR_SID_Pos)         /*!< 0x00000800 */
#define ADC_SIDR_SID_12                   (0x1000UL << ADC_SIDR_SID_Pos)        /*!< 0x00001000 */
#define ADC_SIDR_SID_13                   (0x2000UL << ADC_SIDR_SID_Pos)        /*!< 0x00002000 */
#define ADC_SIDR_SID_14                   (0x4000UL << ADC_SIDR_SID_Pos)        /*!< 0x00004000 */
#define ADC_SIDR_SID_15                   (0x8000UL << ADC_SIDR_SID_Pos)        /*!< 0x00008000 */
#define ADC_SIDR_SID_16                   (0x10000UL << ADC_SIDR_SID_Pos)       /*!< 0x00010000 */
#define ADC_SIDR_SID_17                   (0x20000UL << ADC_SIDR_SID_Pos)       /*!< 0x00020000 */
#define ADC_SIDR_SID_18                   (0x40000UL << ADC_SIDR_SID_Pos)       /*!< 0x00040000 */
#define ADC_SIDR_SID_19                   (0x80000UL << ADC_SIDR_SID_Pos)       /*!< 0x00080000 */
#define ADC_SIDR_SID_20                   (0x100000UL << ADC_SIDR_SID_Pos)      /*!< 0x00100000 */
#define ADC_SIDR_SID_21                   (0x200000UL << ADC_SIDR_SID_Pos)      /*!< 0x00200000 */
#define ADC_SIDR_SID_22                   (0x400000UL << ADC_SIDR_SID_Pos)      /*!< 0x00400000 */
#define ADC_SIDR_SID_23                   (0x800000UL << ADC_SIDR_SID_Pos)      /*!< 0x00800000 */
#define ADC_SIDR_SID_24                   (0x1000000UL << ADC_SIDR_SID_Pos)     /*!< 0x01000000 */
#define ADC_SIDR_SID_25                   (0x2000000UL << ADC_SIDR_SID_Pos)     /*!< 0x02000000 */
#define ADC_SIDR_SID_26                   (0x4000000UL << ADC_SIDR_SID_Pos)     /*!< 0x04000000 */
#define ADC_SIDR_SID_27                   (0x8000000UL << ADC_SIDR_SID_Pos)     /*!< 0x08000000 */
#define ADC_SIDR_SID_28                   (0x10000000UL << ADC_SIDR_SID_Pos)    /*!< 0x10000000 */
#define ADC_SIDR_SID_29                   (0x20000000UL << ADC_SIDR_SID_Pos)    /*!< 0x20000000 */
#define ADC_SIDR_SID_30                   (0x40000000UL << ADC_SIDR_SID_Pos)    /*!< 0x40000000 */
#define ADC_SIDR_SID_31                   (0x80000000UL << ADC_SIDR_SID_Pos)    /*!< 0x80000000 */

/******************************************************************************/
/*                                                                            */
/*                                   VREFBUF                                  */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for VREFBUF_CSR register  ****************/
#define VREFBUF_CSR_ENVR_Pos        (0U)
#define VREFBUF_CSR_ENVR_Msk        (0x1UL << VREFBUF_CSR_ENVR_Pos)             /*!< 0x00000001 */
#define VREFBUF_CSR_ENVR            VREFBUF_CSR_ENVR_Msk                       /*!<Voltage reference buffer enable */
#define VREFBUF_CSR_HIZ_Pos         (1U)
#define VREFBUF_CSR_HIZ_Msk         (0x1UL << VREFBUF_CSR_HIZ_Pos)              /*!< 0x00000002 */
#define VREFBUF_CSR_HIZ             VREFBUF_CSR_HIZ_Msk                        /*!<High impedance mode             */
#define VREFBUF_CSR_VRR_Pos         (3U)
#define VREFBUF_CSR_VRR_Msk         (0x1UL << VREFBUF_CSR_VRR_Pos)              /*!< 0x00000008 */
#define VREFBUF_CSR_VRR             VREFBUF_CSR_VRR_Msk                        /*!<Voltage reference buffer ready  */
#define VREFBUF_CSR_VRS_Pos         (4U)
#define VREFBUF_CSR_VRS_Msk         (0x7UL << VREFBUF_CSR_VRS_Pos)              /*!< 0x00000070 */
#define VREFBUF_CSR_VRS             VREFBUF_CSR_VRS_Msk                        /*!<Voltage reference scale         */

#define VREFBUF_CSR_VRS_OUT1        ((uint32_t)0x00000000)                     /*!<Voltage reference VREF_OUT1     */
#define VREFBUF_CSR_VRS_OUT2_Pos    (4U)
#define VREFBUF_CSR_VRS_OUT2_Msk    (0x1UL << VREFBUF_CSR_VRS_OUT2_Pos)         /*!< 0x00000010 */
#define VREFBUF_CSR_VRS_OUT2        VREFBUF_CSR_VRS_OUT2_Msk                   /*!<Voltage reference VREF_OUT2     */
#define VREFBUF_CSR_VRS_OUT3_Pos    (5U)
#define VREFBUF_CSR_VRS_OUT3_Msk    (0x1UL << VREFBUF_CSR_VRS_OUT3_Pos)         /*!< 0x00000020 */
#define VREFBUF_CSR_VRS_OUT3        VREFBUF_CSR_VRS_OUT3_Msk                   /*!<Voltage reference VREF_OUT3     */
#define VREFBUF_CSR_VRS_OUT4_Pos    (4U)
#define VREFBUF_CSR_VRS_OUT4_Msk    (0x3UL << VREFBUF_CSR_VRS_OUT4_Pos)         /*!< 0x00000030 */
#define VREFBUF_CSR_VRS_OUT4        VREFBUF_CSR_VRS_OUT4_Msk                   /*!<Voltage reference VREF_OUT4     */

/*******************  Bit definition for VREFBUF_CCR register  ****************/
#define VREFBUF_CCR_TRIM_Pos        (0U)
#define VREFBUF_CCR_TRIM_Msk        (0x3FUL << VREFBUF_CCR_TRIM_Pos)            /*!< 0x0000003F */
#define VREFBUF_CCR_TRIM            VREFBUF_CCR_TRIM_Msk                       /*!<TRIM[5:0] bits (Trimming code)  */

/******************************************************************************/
/*                                                                            */
/*                 Flexible Datarate Controller Area Network                  */
/*                                                                            */
/******************************************************************************/
/*!<FDCAN control and status registers */
/*****************  Bit definition for FDCAN_CREL register  *******************/
#define FDCAN_CREL_DAY_Pos        (0U)
#define FDCAN_CREL_DAY_Msk        (0xFFUL << FDCAN_CREL_DAY_Pos)                /*!< 0x000000FF */
#define FDCAN_CREL_DAY            FDCAN_CREL_DAY_Msk                           /*!<Timestamp Day                           */
#define FDCAN_CREL_MON_Pos        (8U)
#define FDCAN_CREL_MON_Msk        (0xFFUL << FDCAN_CREL_MON_Pos)                /*!< 0x0000FF00 */
#define FDCAN_CREL_MON            FDCAN_CREL_MON_Msk                           /*!<Timestamp Month                         */
#define FDCAN_CREL_YEAR_Pos       (16U)
#define FDCAN_CREL_YEAR_Msk       (0xFUL << FDCAN_CREL_YEAR_Pos)                /*!< 0x000F0000 */
#define FDCAN_CREL_YEAR           FDCAN_CREL_YEAR_Msk                          /*!<Timestamp Year                          */
#define FDCAN_CREL_SUBSTEP_Pos    (20U)
#define FDCAN_CREL_SUBSTEP_Msk    (0xFUL << FDCAN_CREL_SUBSTEP_Pos)             /*!< 0x00F00000 */
#define FDCAN_CREL_SUBSTEP        FDCAN_CREL_SUBSTEP_Msk                       /*!<Sub-step of Core release                */
#define FDCAN_CREL_STEP_Pos       (24U)
#define FDCAN_CREL_STEP_Msk       (0xFUL << FDCAN_CREL_STEP_Pos)                /*!< 0x0F000000 */
#define FDCAN_CREL_STEP           FDCAN_CREL_STEP_Msk                          /*!<Step of Core release                    */
#define FDCAN_CREL_REL_Pos        (28U)
#define FDCAN_CREL_REL_Msk        (0xFUL << FDCAN_CREL_REL_Pos)                 /*!< 0xF0000000 */
#define FDCAN_CREL_REL            FDCAN_CREL_REL_Msk                           /*!<Core release                            */

/*****************  Bit definition for FDCAN_ENDN register  *******************/
#define FDCAN_ENDN_ETV_Pos        (0U)
#define FDCAN_ENDN_ETV_Msk        (0xFFFFFFFFUL << FDCAN_ENDN_ETV_Pos)          /*!< 0xFFFFFFFF */
#define FDCAN_ENDN_ETV            FDCAN_ENDN_ETV_Msk                           /*!<TEndiannes Test Value                   */

/*****************  Bit definition for FDCAN_DBTP register  *******************/
#define FDCAN_DBTP_DSJW_Pos       (0U)
#define FDCAN_DBTP_DSJW_Msk       (0xFUL << FDCAN_DBTP_DSJW_Pos)                /*!< 0x0000000F */
#define FDCAN_DBTP_DSJW           FDCAN_DBTP_DSJW_Msk                          /*!<Synchronization Jump Width              */
#define FDCAN_DBTP_DTSEG2_Pos     (4U)
#define FDCAN_DBTP_DTSEG2_Msk     (0xFUL << FDCAN_DBTP_DTSEG2_Pos)              /*!< 0x000000F0 */
#define FDCAN_DBTP_DTSEG2         FDCAN_DBTP_DTSEG2_Msk                        /*!<Data time segment after sample point    */
#define FDCAN_DBTP_DTSEG1_Pos     (8U)
#define FDCAN_DBTP_DTSEG1_Msk     (0x1FUL << FDCAN_DBTP_DTSEG1_Pos)              /*!< 0x00001F00 */
#define FDCAN_DBTP_DTSEG1         FDCAN_DBTP_DTSEG1_Msk                        /*!<Data time segment before sample point   */
#define FDCAN_DBTP_DBRP_Pos       (16U)
#define FDCAN_DBTP_DBRP_Msk       (0x1FUL << FDCAN_DBTP_DBRP_Pos)               /*!< 0x001F0000 */
#define FDCAN_DBTP_DBRP           FDCAN_DBTP_DBRP_Msk                          /*!<Data BIt Rate Prescaler                 */
#define FDCAN_DBTP_TDC_Pos        (23U)
#define FDCAN_DBTP_TDC_Msk        (0x1UL << FDCAN_DBTP_TDC_Pos)                 /*!< 0x00800000 */
#define FDCAN_DBTP_TDC            FDCAN_DBTP_TDC_Msk                           /*!<Transceiver Delay Compensation          */

