zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp133cxx_ca7.h
/**********************  Bit definition for EXTI_VERR register  *****************/
#define EXTI_VERR_MINREV_Pos      (0U)
#define EXTI_VERR_MINREV_Msk      (0xFUL << EXTI_VERR_MINREV_Pos)               /*!< 0x0000000F */
#define EXTI_VERR_MINREV          EXTI_VERR_MINREV_Msk                         /*!< Minor Revision number */
#define EXTI_VERR_MAJREV_Pos      (4U)
#define EXTI_VERR_MAJREV_Msk      (0xFUL << EXTI_VERR_MAJREV_Pos)               /*!< 0x000000F0 */
#define EXTI_VERR_MAJREV          EXTI_VERR_MAJREV_Msk                         /*!< Major Revision number */

/**********************  Bit definition for EXTI_IPIDR register  ****************/
#define EXTI_IPIDR_IPID_Pos       (0U)
#define EXTI_IPIDR_IPID_Msk       (0xFFFFFFFFUL << EXTI_IPIDR_IPID_Pos)         /*!< 0xFFFFFFFF */
#define EXTI_IPIDR_IPID           EXTI_IPIDR_IPID_Msk                          /*!< IP Identification */

/**********************  Bit definition for EXTI_SIDR register  *****************/
#define EXTI_SIDR_SID_Pos         (0U)
#define EXTI_SIDR_SID_Msk         (0xFFFFFFFFUL << EXTI_SIDR_SID_Pos)           /*!< 0xFFFFFFFF */
#define EXTI_SIDR_SID             EXTI_SIDR_SID_Msk                            /*!< IP size identification */

/******************************************************************************/
/*                                                                            */
/*                          Flexible Memory Controller                        */
/*                                                                            */
/******************************************************************************/
/******************  Bit definition for FMC_BCRx registers (x=1..4)  *********/
#define FMC_BCRx_MBKEN_Pos            (0U)
#define FMC_BCRx_MBKEN_Msk            (0x1U << FMC_BCRx_MBKEN_Pos)           /*!< 0x00000001 */
#define FMC_BCRx_MBKEN                FMC_BCRx_MBKEN_Msk                     /*!< Memory bank enable bit. */
#define FMC_BCRx_MUXEN_Pos            (1U)
#define FMC_BCRx_MUXEN_Msk            (0x1U << FMC_BCRx_MUXEN_Pos)           /*!< 0x00000002 */
#define FMC_BCRx_MUXEN                FMC_BCRx_MUXEN_Msk                     /*!< Address/data multiplexing enable bit. */
#define FMC_BCRx_MTYP_Pos             (2U)
#define FMC_BCRx_MTYP_Msk             (0x3U << FMC_BCRx_MTYP_Pos)            /*!< 0x0000000C */
#define FMC_BCRx_MTYP                 FMC_BCRx_MTYP_Msk                      /*!< Memory type. */
#define FMC_BCRx_MWID_Pos             (4U)
#define FMC_BCRx_MWID_Msk             (0x3U << FMC_BCRx_MWID_Pos)            /*!< 0x00000030 */
#define FMC_BCRx_MWID                 FMC_BCRx_MWID_Msk                      /*!< Memory data bus width. */
#define FMC_BCRx_FACCEN_Pos           (6U)
#define FMC_BCRx_FACCEN_Msk           (0x1U << FMC_BCRx_FACCEN_Pos)          /*!< 0x00000040 */
#define FMC_BCRx_FACCEN               FMC_BCRx_FACCEN_Msk                    /*!< Flash memory access enable */
#define FMC_BCRx_BURSTEN_Pos          (8U)
#define FMC_BCRx_BURSTEN_Msk          (0x1U << FMC_BCRx_BURSTEN_Pos)         /*!< 0x00000100 */
#define FMC_BCRx_BURSTEN              FMC_BCRx_BURSTEN_Msk                   /*!< Burst enable bit. */
#define FMC_BCRx_WAITPOL_Pos          (9U)
#define FMC_BCRx_WAITPOL_Msk          (0x1U << FMC_BCRx_WAITPOL_Pos)         /*!< 0x00000200 */
#define FMC_BCRx_WAITPOL              FMC_BCRx_WAITPOL_Msk                   /*!< Wait signal polarity bit. */
#define FMC_BCRx_WAITCFG_Pos          (11U)
#define FMC_BCRx_WAITCFG_Msk          (0x1U << FMC_BCRx_WAITCFG_Pos)         /*!< 0x00000800 */
#define FMC_BCRx_WAITCFG              FMC_BCRx_WAITCFG_Msk                   /*!< Wait timing configuration. */
#define FMC_BCRx_WREN_Pos             (12U)
#define FMC_BCRx_WREN_Msk             (0x1U << FMC_BCRx_WREN_Pos)            /*!< 0x00001000 */
#define FMC_BCRx_WREN                 FMC_BCRx_WREN_Msk                      /*!< Write enable bit. */
#define FMC_BCRx_WAITEN_Pos           (13U)
#define FMC_BCRx_WAITEN_Msk           (0x1U << FMC_BCRx_WAITEN_Pos)          /*!< 0x00002000 */
#define FMC_BCRx_WAITEN               FMC_BCRx_WAITEN_Msk                    /*!< Wait enable bit. */
#define FMC_BCRx_EXTMOD_Pos           (14U)
#define FMC_BCRx_EXTMOD_Msk           (0x1U << FMC_BCRx_EXTMOD_Pos)          /*!< 0x00004000 */
#define FMC_BCRx_EXTMOD               FMC_BCRx_EXTMOD_Msk                    /*!< Extended mode enable. */
#define FMC_BCRx_ASYNCWAIT_Pos        (15U)
#define FMC_BCRx_ASYNCWAIT_Msk        (0x1U << FMC_BCRx_ASYNCWAIT_Pos)       /*!< 0x00008000 */
#define FMC_BCRx_ASYNCWAIT            FMC_BCRx_ASYNCWAIT_Msk                 /*!< Wait signal during asynchronous transfers */
#define FMC_BCRx_CPSIZE_Pos           (16U)
#define FMC_BCRx_CPSIZE_Msk           (0x7U << FMC_BCRx_CPSIZE_Pos)          /*!< 0x00070000 */
#define FMC_BCRx_CPSIZE               FMC_BCRx_CPSIZE_Msk                    /*!< CRAM Page size. */
#define FMC_BCRx_CPSIZE_0             (0x1U << FMC_BCRx_CPSIZE_Pos)          /*!< 0x00010000 */
#define FMC_BCRx_CPSIZE_1             (0x2U << FMC_BCRx_CPSIZE_Pos)          /*!< 0x00020000 */
#define FMC_BCRx_CPSIZE_2             (0x4U << FMC_BCRx_CPSIZE_Pos)          /*!< 0x00040000 */
#define FMC_BCRx_CBURSTRW_Pos         (19U)
#define FMC_BCRx_CBURSTRW_Msk         (0x1U << FMC_BCRx_CBURSTRW_Pos)        /*!< 0x00080000 */
#define FMC_BCRx_CBURSTRW             FMC_BCRx_CBURSTRW_Msk                  /*!< Write burst enable. */
#define FMC_BCRx_CCLKEN_Pos           (20U)
#define FMC_BCRx_CCLKEN_Msk           (0x1U << FMC_BCRx_CCLKEN_Pos)          /*!< 0x00100000 */
#define FMC_BCRx_CCLKEN               FMC_BCRx_CCLKEN_Msk                    /*!< Clock enable */
#define FMC_BCRx_NBLSET_Pos           (22U)
#define FMC_BCRx_NBLSET_Msk           (0x3U << FMC_BCRx_NBLSET_Pos)          /*!< 0x00C00000 */
#define FMC_BCRx_NBLSET               FMC_BCRx_NBLSET_Msk                    /*!< Byte lane (NBL) SETUP */
#define FMC_BCRx_FMCEN_Pos            (31U)
#define FMC_BCRx_FMCEN_Msk            (0x1U << FMC_BCRx_FMCEN_Pos)           /*!< 0x80000000 */
#define FMC_BCRx_FMCEN                FMC_BCRx_FMCEN_Msk                     /*!< Clock enable */

/******************  Bit definition for FMC_BTRx registers (x=1..4)  *********/
#define FMC_BTRx_ADDSET_Pos           (0U)
#define FMC_BTRx_ADDSET_Msk           (0xFU << FMC_BTRx_ADDSET_Pos)          /*!< 0x0000000F */
#define FMC_BTRx_ADDSET               FMC_BTRx_ADDSET_Msk                    /*!< Address setup phase duration */
#define FMC_BTRx_ADDHLD_Pos           (4U)
#define FMC_BTRx_ADDHLD_Msk           (0xFU << FMC_BTRx_ADDHLD_Pos)          /*!< 0x000000F0 */
#define FMC_BTRx_ADDHLD               FMC_BTRx_ADDHLD_Msk                    /*!< Address-hold phase duration */
#define FMC_BTRx_DATAST_Pos           (8U)
#define FMC_BTRx_DATAST_Msk           (0xFFU << FMC_BTRx_DATAST_Pos)         /*!< 0x0000FF00 */
#define FMC_BTRx_DATAST               FMC_BTRx_DATAST_Msk                    /*!< Data-phase duration */
#define FMC_BTRx_BUSTURN_Pos          (16U)
#define FMC_BTRx_BUSTURN_Msk          (0xFU << FMC_BTRx_BUSTURN_Pos)         /*!< 0x000F0000 */
#define FMC_BTRx_BUSTURN              FMC_BTRx_BUSTURN_Msk                   /*!< Bus turnaround phase duration */
#define FMC_BTRx_CLKDIV_Pos           (20U)
#define FMC_BTRx_CLKDIV_Msk           (0xFU << FMC_BTRx_CLKDIV_Pos)          /*!< 0x00F00000 */
#define FMC_BTRx_CLKDIV               FMC_BTRx_CLKDIV_Msk                    /*!< Clock divide ratio (for FMC_CLK signal) */
#define FMC_BTRx_DATLAT_Pos           (24U)
#define FMC_BTRx_DATLAT_Msk           (0xFU << FMC_BTRx_DATLAT_Pos)          /*!< 0x0F000000 */
#define FMC_BTRx_DATLAT               FMC_BTRx_DATLAT_Msk                    /*!< Data latency for synchronous memory (see note below bit descriptions) */
#define FMC_BTRx_ACCMOD_Pos           (28U)
#define FMC_BTRx_ACCMOD_Msk           (0x3U << FMC_BTRx_ACCMOD_Pos)          /*!< 0x30000000 */
#define FMC_BTRx_ACCMOD               FMC_BTRx_ACCMOD_Msk                    /*!< Access mode */
#define FMC_BTRx_DATAHLD_Pos          (30U)
#define FMC_BTRx_DATAHLD_Msk          (0x3U << FMC_BTRx_DATAHLD_Pos)         /*!< 0xC0000000 */
#define FMC_BTRx_DATAHLD              FMC_BTRx_DATAHLD_Msk                   /*!< Data Hold phase duration */

