zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp133cxx_ca7.h
/*******************  Bit definition for SAES_DINR register  *******************/
#define SAES_DINR_Pos                       (0U)
#define SAES_DINR_Msk                       (0xFFFFFFFFUL << SAES_DINR_Pos)         /*!< 0xFFFFFFFF */
#define SAES_DINR                           SAES_DINR_Msk                           /*!< SAES Data Input Register */

/*******************  Bit definition for SAES_DOUTR register  ******************/
#define SAES_DOUTR_Pos                      (0U)
#define SAES_DOUTR_Msk                      (0xFFFFFFFFUL << SAES_DOUTR_Pos)        /*!< 0xFFFFFFFF */
#define SAES_DOUTR                          SAES_DOUTR_Msk                          /*!< SAES Data Output Register */

/*******************  Bit definition for SAES_KEYR0 register  ******************/
#define SAES_KEYR0_Pos                      (0U)
#define SAES_KEYR0_Msk                      (0xFFFFFFFFUL << SAES_KEYR0_Pos)        /*!< 0xFFFFFFFF */
#define SAES_KEYR0                          SAES_KEYR0_Msk                          /*!< SAES Key Register 0 */

/*******************  Bit definition for SAES_KEYR1 register  ******************/
#define SAES_KEYR1_Pos                      (0U)
#define SAES_KEYR1_Msk                      (0xFFFFFFFFUL << SAES_KEYR1_Pos)        /*!< 0xFFFFFFFF */
#define SAES_KEYR1                          SAES_KEYR1_Msk                          /*!< SAES Key Register 1 */

/*******************  Bit definition for SAES_KEYR2 register  ******************/
#define SAES_KEYR2_Pos                      (0U)
#define SAES_KEYR2_Msk                      (0xFFFFFFFFUL << SAES_KEYR2_Pos)        /*!< 0xFFFFFFFF */
#define SAES_KEYR2                          SAES_KEYR2_Msk                          /*!< SAES Key Register 2 */

/*******************  Bit definition for SAES_KEYR3 register  ******************/
#define SAES_KEYR3_Pos                      (0U)
#define SAES_KEYR3_Msk                      (0xFFFFFFFFUL << SAES_KEYR3_Pos)        /*!< 0xFFFFFFFF */
#define SAES_KEYR3                          SAES_KEYR3_Msk                          /*!< SAES Key Register 3 */

/*******************  Bit definition for SAES_KEYR4 register  ******************/
#define SAES_KEYR4_Pos                      (0U)
#define SAES_KEYR4_Msk                      (0xFFFFFFFFUL << SAES_KEYR4_Pos)        /*!< 0xFFFFFFFF */
#define SAES_KEYR4                          SAES_KEYR4_Msk                          /*!< SAES Key Register 4 */

/*******************  Bit definition for SAES_KEYR5 register  ******************/
#define SAES_KEYR5_Pos                      (0U)
#define SAES_KEYR5_Msk                      (0xFFFFFFFFUL << SAES_KEYR5_Pos)        /*!< 0xFFFFFFFF */
#define SAES_KEYR5                          SAES_KEYR5_Msk                          /*!< SAES Key Register 5 */

/*******************  Bit definition for SAES_KEYR6 register  ******************/
#define SAES_KEYR6_Pos                      (0U)
#define SAES_KEYR6_Msk                      (0xFFFFFFFFUL << SAES_KEYR6_Pos)        /*!< 0xFFFFFFFF */
#define SAES_KEYR6                          SAES_KEYR6_Msk                          /*!< SAES Key Register 6 */

/*******************  Bit definition for SAES_KEYR7 register  ******************/
#define SAES_KEYR7_Pos                      (0U)
#define SAES_KEYR7_Msk                      (0xFFFFFFFFUL << SAES_KEYR7_Pos)        /*!< 0xFFFFFFFF */
#define SAES_KEYR7                          SAES_KEYR7_Msk                          /*!< SAES Key Register 7 */

/*******************  Bit definition for SAES_IVR0 register   ******************/
#define SAES_IVR0_Pos                       (0U)
#define SAES_IVR0_Msk                       (0xFFFFFFFFUL << SAES_IVR0_Pos)         /*!< 0xFFFFFFFF */
#define SAES_IVR0                           SAES_IVR0_Msk                           /*!< SAES Initialization Vector Register 0 */

/*******************  Bit definition for SAES_IVR1 register   ******************/
#define SAES_IVR1_Pos                       (0U)
#define SAES_IVR1_Msk                       (0xFFFFFFFFUL << SAES_IVR1_Pos)         /*!< 0xFFFFFFFF */
#define SAES_IVR1                           SAES_IVR1_Msk                           /*!< SAES Initialization Vector Register 1 */

/*******************  Bit definition for SAES_IVR2 register   ******************/
#define SAES_IVR2_Pos                       (0U)
#define SAES_IVR2_Msk                       (0xFFFFFFFFUL << SAES_IVR2_Pos)         /*!< 0xFFFFFFFF */
#define SAES_IVR2                           SAES_IVR2_Msk                           /*!< SAES Initialization Vector Register 2 */

/*******************  Bit definition for SAES_IVR3 register   ******************/
#define SAES_IVR3_Pos                       (0U)
#define SAES_IVR3_Msk                       (0xFFFFFFFFUL << SAES_IVR3_Pos)         /*!< 0xFFFFFFFF */
#define SAES_IVR3                           SAES_IVR3_Msk                           /*!< SAES Initialization Vector Register 3 */

/*******************  Bit definition for SAES_DPACFGR register  ******************/
#define SAES_REDCFG_Pos                     (0U)
#define SAES_REDCFG_Msk                     (0x3UL << SAES_REDCFG_Pos)
#define SAES_REDCFG                         SAES_REDCFG_Msk                         /*!< SAES Redundancy configuration */
#define SAES_REDCFG_0                       (0x1UL << SAES_REDCFG_Pos)
#define SAES_REDCFG_1                       (0x2UL << SAES_REDCFG_Pos)
#define SAES_RESEED_Pos                     (2U)
#define SAES_RESEED_Msk                     (0x1UL << SAES_RESEED_Pos)
#define SAES_RESEED                         SAES_RESEED_Msk                         /*!< SAES Automatic reseed */
#define SAES_TRIMCFG_Pos                    (3U)
#define SAES_TRIMCFG_Msk                    (0x3UL << SAES_TRIMCFG_Pos)
#define SAES_TRIMCFG                        SAES_TRIMCFG_Msk                        /*!< SAES Clock trimming */
#define SAES_TRIMCFG_0                      (0x1UL << SAES_TRIMCFG_Pos)
#define SAES_TRIMCFG_1                      (0x2UL << SAES_TRIMCFG_Pos)
#define SAES_CONFIGLOCK_Pos                 (31U)
#define SAES_CONFIGLOCK_Msk                 (0x1UL << SAES_CONFIGLOCK_Pos)
#define SAES_CONFIGLOCK                     SAES_CONFIGLOCK_Msk                     /*!< SAES DPA configuration lock*/

/*******************  Bit definition for SAES_IER register     ******************/
#define SAES_IER_CCFIE_Pos                  (0U)
#define SAES_IER_CCFIE_Msk                  (0x1UL << SAES_IER_CCFIE_Pos)           /*!< 0x00000001 */
#define SAES_IER_CCFIE                      SAES_IER_CCFIE_Msk                      /*!< Computation complete flag interrupt enable */
#define SAES_IER_RWEIE_Pos                  (1U)
#define SAES_IER_RWEIE_Msk                  (0x1UL << SAES_IER_RWEIE_Pos)           /*!< 0x00000002 */
#define SAES_IER_RWEIE                      SAES_IER_RWEIE_Msk                      /*!< Read or write error Interrupt Enable */
#define SAES_IER_KEIE_Pos                   (2U)
#define SAES_IER_KEIE_Msk                   (0x1UL << SAES_IER_KEIE_Pos)            /*!< 0x00000004 */
#define SAES_IER_KEIE                       SAES_IER_KEIE_Msk                       /*!< Key error interrupt enable */
#define SAES_IER_RNGEIE_Pos                 (3U)
#define SAES_IER_RNGEIE_Msk                 (0x1UL << SAES_IER_RNGEIE_Pos)          /*!< RNG error interrupt enable */
#define SAES_IER_RNGEIE                     SAES_IER_RNGEIE_Msk

/*******************  Bit definition for SAES_ISR register     ******************/
#define SAES_ISR_CCF_Pos                    (0U)
#define SAES_ISR_CCF_Msk                    (0x1UL << SAES_ISR_CCF_Pos)             /*!< 0x00000001 */
#define SAES_ISR_CCF                        SAES_ISR_CCF_Msk                        /*!< Computation complete flag */
#define SAES_ISR_RWEIF_Pos                  (1U)
#define SAES_ISR_RWEIF_Msk                  (0x1UL << SAES_ISR_RWEIF_Pos)           /*!< 0x00000002 */
#define SAES_ISR_RWEIF                      SAES_ISR_RWEIF_Msk                      /*!< Read or write error Interrupt flag */
#define SAES_ISR_KEIF_Pos                   (2U)
#define SAES_ISR_KEIF_Msk                   (0x1UL << SAES_ISR_KEIF_Pos)            /*!< 0x00000004 */
#define SAES_ISR_KEIF                       SAES_ISR_KEIF_Msk                       /*!< Key error interrupt flag */
#define SAES_ISR_RNGEIF_Pos                 (3U)
#define SAES_ISR_RNGEIF_Msk                 (0x1UL << SAES_ISR_RNGEIF_Pos)          /*!< 0x00000004 */
#define SAES_ISR_RNGEIF                     SAES_ISR_RNGEIF_Msk                     /*!< RNG error interrupt flag*/

