zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp133cxx_ca7.h
/***************  Bit definition for RCC_ADC12CKSELR register  ****************/
#define RCC_ADC12CKSELR_ADC1SRC_Pos                (0U)
#define RCC_ADC12CKSELR_ADC1SRC_Msk                (0x3UL << RCC_ADC12CKSELR_ADC1SRC_Pos)               /*!< 0x00000003 */
#define RCC_ADC12CKSELR_ADC1SRC                    RCC_ADC12CKSELR_ADC1SRC_Msk                         /*!< ADC1 kernel clock source selection If ADC1 block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Written by software. others: the kernel clock is disabled */
#define RCC_ADC12CKSELR_ADC1SRC_0                  (0x1UL << RCC_ADC12CKSELR_ADC1SRC_Pos)               /*!< 0x00000001 */
#define RCC_ADC12CKSELR_ADC1SRC_1                  (0x2UL << RCC_ADC12CKSELR_ADC1SRC_Pos)               /*!< 0x00000002 */
#define RCC_ADC12CKSELR_ADC2SRC_Pos                (2U)
#define RCC_ADC12CKSELR_ADC2SRC_Msk                (0x3UL << RCC_ADC12CKSELR_ADC2SRC_Pos)               /*!< 0x0000000C */
#define RCC_ADC12CKSELR_ADC2SRC                    RCC_ADC12CKSELR_ADC2SRC_Msk                         /*!< ADC2 kernel clock source selection If ADC2 block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Written by software. others: the kernel clock is disabled */
#define RCC_ADC12CKSELR_ADC2SRC_0                  (0x1UL << RCC_ADC12CKSELR_ADC2SRC_Pos)               /*!< 0x00000004 */
#define RCC_ADC12CKSELR_ADC2SRC_1                  (0x2UL << RCC_ADC12CKSELR_ADC2SRC_Pos)               /*!< 0x00000008 */

/**************  Bit definition for RCC_SDMMC12CKSELR register  ***************/
#define RCC_SDMMC12CKSELR_SDMMC1SRC_Pos            (0U)
#define RCC_SDMMC12CKSELR_SDMMC1SRC_Msk            (0x7UL << RCC_SDMMC12CKSELR_SDMMC1SRC_Pos)           /*!< 0x00000007 */
#define RCC_SDMMC12CKSELR_SDMMC1SRC                RCC_SDMMC12CKSELR_SDMMC1SRC_Msk                     /*!< SDMMC1 kernel clock source selection If SDMMC1 block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Written by software. others: reserved, the kernel clock is disabled */
#define RCC_SDMMC12CKSELR_SDMMC1SRC_0              (0x1UL << RCC_SDMMC12CKSELR_SDMMC1SRC_Pos)           /*!< 0x00000001 */
#define RCC_SDMMC12CKSELR_SDMMC1SRC_1              (0x2UL << RCC_SDMMC12CKSELR_SDMMC1SRC_Pos)           /*!< 0x00000002 */
#define RCC_SDMMC12CKSELR_SDMMC1SRC_2              (0x4UL << RCC_SDMMC12CKSELR_SDMMC1SRC_Pos)           /*!< 0x00000004 */
#define RCC_SDMMC12CKSELR_SDMMC2SRC_Pos            (3U)
#define RCC_SDMMC12CKSELR_SDMMC2SRC_Msk            (0x7UL << RCC_SDMMC12CKSELR_SDMMC2SRC_Pos)           /*!< 0x00000038 */
#define RCC_SDMMC12CKSELR_SDMMC2SRC                RCC_SDMMC12CKSELR_SDMMC2SRC_Msk                     /*!< SDMMC2 kernel clock source selection If SDMMC2 block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Written by software. others: reserved, the kernel clock is disabled */
#define RCC_SDMMC12CKSELR_SDMMC2SRC_0              (0x1UL << RCC_SDMMC12CKSELR_SDMMC2SRC_Pos)           /*!< 0x00000008 */
#define RCC_SDMMC12CKSELR_SDMMC2SRC_1              (0x2UL << RCC_SDMMC12CKSELR_SDMMC2SRC_Pos)          /*!< 0x00000010 */
#define RCC_SDMMC12CKSELR_SDMMC2SRC_2              (0x4UL << RCC_SDMMC12CKSELR_SDMMC2SRC_Pos)          /*!< 0x00000020 */

/***************  Bit definition for RCC_ETH12CKSELR register  ****************/
#define RCC_ETH12CKSELR_ETH1SRC_Pos                (0U)
#define RCC_ETH12CKSELR_ETH1SRC_Msk                (0x3UL << RCC_ETH12CKSELR_ETH1SRC_Pos)               /*!< 0x00000003 */
#define RCC_ETH12CKSELR_ETH1SRC                    RCC_ETH12CKSELR_ETH1SRC_Msk                         /*!< ETH1 kernel clock source selection If ETH1 block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Written by software. others: the kernel clock is disabled */
#define RCC_ETH12CKSELR_ETH1SRC_0                  (0x1UL << RCC_ETH12CKSELR_ETH1SRC_Pos)               /*!< 0x00000001 */
#define RCC_ETH12CKSELR_ETH1SRC_1                  (0x2UL << RCC_ETH12CKSELR_ETH1SRC_Pos)               /*!< 0x00000002 */
#define RCC_ETH12CKSELR_ETH1PTPDIV_Pos             (4U)
#define RCC_ETH12CKSELR_ETH1PTPDIV_Msk             (0xFUL << RCC_ETH12CKSELR_ETH1PTPDIV_Pos)            /*!< 0x000000F0 */
#define RCC_ETH12CKSELR_ETH1PTPDIV                 RCC_ETH12CKSELR_ETH1PTPDIV_Msk                      /*!< ETH1 clock divider for Precision Time Protocol (PTP) If ETH1 block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Written by software to configure the divider value. ... */
#define RCC_ETH12CKSELR_ETH1PTPDIV_0               (0x1UL << RCC_ETH12CKSELR_ETH1PTPDIV_Pos)           /*!< 0x00000010 */
#define RCC_ETH12CKSELR_ETH1PTPDIV_1               (0x2UL << RCC_ETH12CKSELR_ETH1PTPDIV_Pos)           /*!< 0x00000020 */
#define RCC_ETH12CKSELR_ETH1PTPDIV_2               (0x4UL << RCC_ETH12CKSELR_ETH1PTPDIV_Pos)           /*!< 0x00000040 */
#define RCC_ETH12CKSELR_ETH1PTPDIV_3               (0x8UL << RCC_ETH12CKSELR_ETH1PTPDIV_Pos)           /*!< 0x00000080 */
#define RCC_ETH12CKSELR_ETH2SRC_Pos                (8U)
#define RCC_ETH12CKSELR_ETH2SRC_Msk                (0x3UL << RCC_ETH12CKSELR_ETH2SRC_Pos)               /*!< 0x00000300 */
#define RCC_ETH12CKSELR_ETH2SRC                    RCC_ETH12CKSELR_ETH2SRC_Msk                         /*!< ETH2 kernel clock source selection If ETH2 block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Written by software. others: the kernel clock is disabled */
#define RCC_ETH12CKSELR_ETH2SRC_0                  (0x1UL << RCC_ETH12CKSELR_ETH2SRC_Pos)             /*!< 0x00000100 */
#define RCC_ETH12CKSELR_ETH2SRC_1                  (0x2UL << RCC_ETH12CKSELR_ETH2SRC_Pos)             /*!< 0x00000200 */
#define RCC_ETH12CKSELR_ETH2PTPDIV_Pos             (12U)
#define RCC_ETH12CKSELR_ETH2PTPDIV_Msk             (0xFUL << RCC_ETH12CKSELR_ETH2PTPDIV_Pos)            /*!< 0x0000F000 */
#define RCC_ETH12CKSELR_ETH2PTPDIV                 RCC_ETH12CKSELR_ETH2PTPDIV_Msk                      /*!< ETH2 clock divider for Precision Time Protocol (PTP) If ETH2 block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Written by software to configure the divider value. ... */
#define RCC_ETH12CKSELR_ETH2PTPDIV_0               (0x1UL << RCC_ETH12CKSELR_ETH2PTPDIV_Pos)         /*!< 0x00001000 */
#define RCC_ETH12CKSELR_ETH2PTPDIV_1               (0x2UL << RCC_ETH12CKSELR_ETH2PTPDIV_Pos)         /*!< 0x00002000 */
#define RCC_ETH12CKSELR_ETH2PTPDIV_2               (0x4UL << RCC_ETH12CKSELR_ETH2PTPDIV_Pos)         /*!< 0x00004000 */
#define RCC_ETH12CKSELR_ETH2PTPDIV_3               (0x8UL << RCC_ETH12CKSELR_ETH2PTPDIV_Pos)         /*!< 0x00008000 */

/****************  Bit definition for RCC_USBCKSELR register  *****************/
#define RCC_USBCKSELR_USBPHYSRC_Pos                (0U)
#define RCC_USBCKSELR_USBPHYSRC_Msk                (0x3UL << RCC_USBCKSELR_USBPHYSRC_Pos)               /*!< 0x00000003 */
#define RCC_USBCKSELR_USBPHYSRC                    RCC_USBCKSELR_USBPHYSRC_Msk                         /*!< USB PHY kernel clock source selection If USBPHY block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Written by software. other: clock disabled */
#define RCC_USBCKSELR_USBPHYSRC_0                  (0x1UL << RCC_USBCKSELR_USBPHYSRC_Pos)               /*!< 0x00000001 */
#define RCC_USBCKSELR_USBPHYSRC_1                  (0x2UL << RCC_USBCKSELR_USBPHYSRC_Pos)               /*!< 0x00000002 */
#define RCC_USBCKSELR_USBOSRC_Pos                  (4U)
#define RCC_USBCKSELR_USBOSRC_Msk                  (0x1UL << RCC_USBCKSELR_USBOSRC_Pos)                 /*!< 0x00000010 */
#define RCC_USBCKSELR_USBOSRC                      RCC_USBCKSELR_USBOSRC_Msk                           /*!< USB OTG kernel clock source selection If USBO block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Written by software. */

/****************  Bit definition for RCC_QSPICKSELR register  ****************/
#define RCC_QSPICKSELR_QSPISRC_Pos                 (0U)
#define RCC_QSPICKSELR_QSPISRC_Msk                 (0x3UL << RCC_QSPICKSELR_QSPISRC_Pos)                /*!< 0x00000003 */
#define RCC_QSPICKSELR_QSPISRC                     RCC_QSPICKSELR_QSPISRC_Msk                          /*!< QUADSPI kernel clock source selection Written by software. */
#define RCC_QSPICKSELR_QSPISRC_0                   (0x1UL << RCC_QSPICKSELR_QSPISRC_Pos)                /*!< 0x00000001 */
#define RCC_QSPICKSELR_QSPISRC_1                   (0x2UL << RCC_QSPICKSELR_QSPISRC_Pos)                /*!< 0x00000002 */

/****************  Bit definition for RCC_FMCCKSELR register  *****************/
#define RCC_FMCCKSELR_FMCSRC_Pos                   (0U)
#define RCC_FMCCKSELR_FMCSRC_Msk                   (0x3UL << RCC_FMCCKSELR_FMCSRC_Pos)                  /*!< 0x00000003 */
#define RCC_FMCCKSELR_FMCSRC                       RCC_FMCCKSELR_FMCSRC_Msk                            /*!< FMC kernel clock source selection Written by software. */
#define RCC_FMCCKSELR_FMCSRC_0                     (0x1UL << RCC_FMCCKSELR_FMCSRC_Pos)                  /*!< 0x00000001 */
#define RCC_FMCCKSELR_FMCSRC_1                     (0x2UL << RCC_FMCCKSELR_FMCSRC_Pos)                  /*!< 0x00000002 */

/****************  Bit definition for RCC_RNG1CKSELR register  ****************/
#define RCC_RNG1CKSELR_RNG1SRC_Pos                 (0U)
#define RCC_RNG1CKSELR_RNG1SRC_Msk                 (0x3UL << RCC_RNG1CKSELR_RNG1SRC_Pos)                /*!< 0x00000003 */
#define RCC_RNG1CKSELR_RNG1SRC                     RCC_RNG1CKSELR_RNG1SRC_Msk                          /*!< RNG1 kernel clock source selection Written by software. */
#define RCC_RNG1CKSELR_RNG1SRC_0                   (0x1UL << RCC_RNG1CKSELR_RNG1SRC_Pos)                /*!< 0x00000001 */
#define RCC_RNG1CKSELR_RNG1SRC_1                   (0x2UL << RCC_RNG1CKSELR_RNG1SRC_Pos)                /*!< 0x00000002 */

/***************  Bit definition for RCC_STGENCKSELR register  ****************/
#define RCC_STGENCKSELR_STGENSRC_Pos               (0U)
#define RCC_STGENCKSELR_STGENSRC_Msk               (0x3UL << RCC_STGENCKSELR_STGENSRC_Pos)              /*!< 0x00000003 */
#define RCC_STGENCKSELR_STGENSRC                   RCC_STGENCKSELR_STGENSRC_Msk                        /*!< Oscillator selection for kernel clock Set and cleared by software. others: Clock disabled */
#define RCC_STGENCKSELR_STGENSRC_0                 (0x1UL << RCC_STGENCKSELR_STGENSRC_Pos)              /*!< 0x00000001 */
#define RCC_STGENCKSELR_STGENSRC_1                 (0x2UL << RCC_STGENCKSELR_STGENSRC_Pos)              /*!< 0x00000002 */

/***************  Bit definition for RCC_DCMIPPCKSELR register  ***************/
#define RCC_DCMIPPCKSELR_DCMIPPSRC_Pos             (0U)
#define RCC_DCMIPPCKSELR_DCMIPPSRC_Msk             (0x3UL << RCC_DCMIPPCKSELR_DCMIPPSRC_Pos)            /*!< 0x00000003 */
#define RCC_DCMIPPCKSELR_DCMIPPSRC                 RCC_DCMIPPCKSELR_DCMIPPSRC_Msk                      /*!< DCMIPP kernel clock source selection Written by software. */
#define RCC_DCMIPPCKSELR_DCMIPPSRC_0               (0x1UL << RCC_DCMIPPCKSELR_DCMIPPSRC_Pos)            /*!< 0x00000001 */
#define RCC_DCMIPPCKSELR_DCMIPPSRC_1               (0x2UL << RCC_DCMIPPCKSELR_DCMIPPSRC_Pos)            /*!< 0x00000002 */

