zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp133cxx_ca7.h
/*************  Bit definition for RCC_MP_AHB2LPENSETR register  **************/
#define RCC_MP_AHB2LPENSETR_DMA1LPEN_Pos           (0U)
#define RCC_MP_AHB2LPENSETR_DMA1LPEN_Msk           (0x1UL << RCC_MP_AHB2LPENSETR_DMA1LPEN_Pos)          /*!< 0x00000001 */
#define RCC_MP_AHB2LPENSETR_DMA1LPEN               RCC_MP_AHB2LPENSETR_DMA1LPEN_Msk                    /*!< DMA1 peripheral clocks enable during Sleep mode Set by software. */
#define RCC_MP_AHB2LPENSETR_DMA2LPEN_Pos           (1U)
#define RCC_MP_AHB2LPENSETR_DMA2LPEN_Msk           (0x1UL << RCC_MP_AHB2LPENSETR_DMA2LPEN_Pos)          /*!< 0x00000002 */
#define RCC_MP_AHB2LPENSETR_DMA2LPEN               RCC_MP_AHB2LPENSETR_DMA2LPEN_Msk                    /*!< DMA2 peripheral clocks enable during Sleep mode Set by software. */
#define RCC_MP_AHB2LPENSETR_DMAMUX1LPEN_Pos        (2U)
#define RCC_MP_AHB2LPENSETR_DMAMUX1LPEN_Msk        (0x1UL << RCC_MP_AHB2LPENSETR_DMAMUX1LPEN_Pos)       /*!< 0x00000004 */
#define RCC_MP_AHB2LPENSETR_DMAMUX1LPEN            RCC_MP_AHB2LPENSETR_DMAMUX1LPEN_Msk                 /*!< DMAMUX1 peripheral clocks enable during Sleep mode Set by software. */
#define RCC_MP_AHB2LPENSETR_DMA3LPEN_Pos           (3U)
#define RCC_MP_AHB2LPENSETR_DMA3LPEN_Msk           (0x1UL << RCC_MP_AHB2LPENSETR_DMA3LPEN_Pos)          /*!< 0x00000008 */
#define RCC_MP_AHB2LPENSETR_DMA3LPEN               RCC_MP_AHB2LPENSETR_DMA3LPEN_Msk                    /*!< DMA3 peripheral clocks enable during Sleep mode If DMA3 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_AHB2LPENSETR_DMAMUX2LPEN_Pos        (4U)
#define RCC_MP_AHB2LPENSETR_DMAMUX2LPEN_Msk        (0x1UL << RCC_MP_AHB2LPENSETR_DMAMUX2LPEN_Pos)       /*!< 0x00000010 */
#define RCC_MP_AHB2LPENSETR_DMAMUX2LPEN            RCC_MP_AHB2LPENSETR_DMAMUX2LPEN_Msk                 /*!< DMAMUX2 peripheral clocks enable during Sleep mode If DMAMUX2 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_AHB2LPENSETR_ADC1LPEN_Pos           (5U)
#define RCC_MP_AHB2LPENSETR_ADC1LPEN_Msk           (0x1UL << RCC_MP_AHB2LPENSETR_ADC1LPEN_Pos)          /*!< 0x00000020 */
#define RCC_MP_AHB2LPENSETR_ADC1LPEN               RCC_MP_AHB2LPENSETR_ADC1LPEN_Msk                    /*!< ADC1 peripheral clocks enable during Sleep mode If ADC1 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_AHB2LPENSETR_ADC2LPEN_Pos           (6U)
#define RCC_MP_AHB2LPENSETR_ADC2LPEN_Msk           (0x1UL << RCC_MP_AHB2LPENSETR_ADC2LPEN_Pos)          /*!< 0x00000040 */
#define RCC_MP_AHB2LPENSETR_ADC2LPEN               RCC_MP_AHB2LPENSETR_ADC2LPEN_Msk                    /*!< ADC2 peripheral clocks enable during Sleep mode If ADC2 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_AHB2LPENSETR_USBOLPEN_Pos           (8U)
#define RCC_MP_AHB2LPENSETR_USBOLPEN_Msk           (0x1UL << RCC_MP_AHB2LPENSETR_USBOLPEN_Pos)          /*!< 0x00000100 */
#define RCC_MP_AHB2LPENSETR_USBOLPEN               RCC_MP_AHB2LPENSETR_USBOLPEN_Msk                    /*!< USBO peripheral clocks enable during Sleep mode If USBO is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */

/*************  Bit definition for RCC_MP_AHB2LPENCLRR register  **************/
#define RCC_MP_AHB2LPENCLRR_DMA1LPEN_Pos           (0U)
#define RCC_MP_AHB2LPENCLRR_DMA1LPEN_Msk           (0x1UL << RCC_MP_AHB2LPENCLRR_DMA1LPEN_Pos)          /*!< 0x00000001 */
#define RCC_MP_AHB2LPENCLRR_DMA1LPEN               RCC_MP_AHB2LPENCLRR_DMA1LPEN_Msk                    /*!< DMA1 peripheral clocks enable during Sleep mode Cleared by software. */
#define RCC_MP_AHB2LPENCLRR_DMA2LPEN_Pos           (1U)
#define RCC_MP_AHB2LPENCLRR_DMA2LPEN_Msk           (0x1UL << RCC_MP_AHB2LPENCLRR_DMA2LPEN_Pos)          /*!< 0x00000002 */
#define RCC_MP_AHB2LPENCLRR_DMA2LPEN               RCC_MP_AHB2LPENCLRR_DMA2LPEN_Msk                    /*!< DMA2 peripheral clocks enable during Sleep mode Cleared by software. */
#define RCC_MP_AHB2LPENCLRR_DMAMUX1LPEN_Pos        (2U)
#define RCC_MP_AHB2LPENCLRR_DMAMUX1LPEN_Msk        (0x1UL << RCC_MP_AHB2LPENCLRR_DMAMUX1LPEN_Pos)       /*!< 0x00000004 */
#define RCC_MP_AHB2LPENCLRR_DMAMUX1LPEN            RCC_MP_AHB2LPENCLRR_DMAMUX1LPEN_Msk                 /*!< DMAMUX1 peripheral clocks enable during Sleep mode Cleared by software. */
#define RCC_MP_AHB2LPENCLRR_DMA3LPEN_Pos           (3U)
#define RCC_MP_AHB2LPENCLRR_DMA3LPEN_Msk           (0x1UL << RCC_MP_AHB2LPENCLRR_DMA3LPEN_Pos)          /*!< 0x00000008 */
#define RCC_MP_AHB2LPENCLRR_DMA3LPEN               RCC_MP_AHB2LPENCLRR_DMA3LPEN_Msk                    /*!< DMA3 peripheral clocks enable during Sleep mode If DMA3 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_MP_AHB2LPENCLRR_DMAMUX2LPEN_Pos        (4U)
#define RCC_MP_AHB2LPENCLRR_DMAMUX2LPEN_Msk        (0x1UL << RCC_MP_AHB2LPENCLRR_DMAMUX2LPEN_Pos)       /*!< 0x00000010 */
#define RCC_MP_AHB2LPENCLRR_DMAMUX2LPEN            RCC_MP_AHB2LPENCLRR_DMAMUX2LPEN_Msk                 /*!< DMAMUX2 peripheral clocks enable during Sleep mode If DMAMUX2 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_MP_AHB2LPENCLRR_ADC1LPEN_Pos           (5U)
#define RCC_MP_AHB2LPENCLRR_ADC1LPEN_Msk           (0x1UL << RCC_MP_AHB2LPENCLRR_ADC1LPEN_Pos)          /*!< 0x00000020 */
#define RCC_MP_AHB2LPENCLRR_ADC1LPEN               RCC_MP_AHB2LPENCLRR_ADC1LPEN_Msk                    /*!< ADC1 peripheral clocks enable during Sleep mode If ADC1 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_MP_AHB2LPENCLRR_ADC2LPEN_Pos           (6U)
#define RCC_MP_AHB2LPENCLRR_ADC2LPEN_Msk           (0x1UL << RCC_MP_AHB2LPENCLRR_ADC2LPEN_Pos)          /*!< 0x00000040 */
#define RCC_MP_AHB2LPENCLRR_ADC2LPEN               RCC_MP_AHB2LPENCLRR_ADC2LPEN_Msk                    /*!< ADC2 peripheral clocks enable during Sleep mode If ADC2 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_MP_AHB2LPENCLRR_USBOLPEN_Pos           (8U)
#define RCC_MP_AHB2LPENCLRR_USBOLPEN_Msk           (0x1UL << RCC_MP_AHB2LPENCLRR_USBOLPEN_Pos)          /*!< 0x00000100 */
#define RCC_MP_AHB2LPENCLRR_USBOLPEN               RCC_MP_AHB2LPENCLRR_USBOLPEN_Msk                    /*!< USBO peripheral clocks enable during Sleep mode If USBO is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */

